{
"МЕДИАКОНТЕНТ": "Совокупность различных видов данных, содержащих текстовую, звуковую и визуальную информацию — графику, видео, анимацию.",
"ИНТЕРНЕТ-ТРАФИК": "Объем информации, передаваемой через компьютерную сеть за определенный период времени.",
"ВЕБ-СЕРВИС": "Технология, программная система, позволяющая системам обмениваться данными друг с другом через сетевое подключение.",
"ВЕБ-ПЛАТФОРМА": "Среда выполнения, в которой должен выполняться вновь разрабатываемый фрагмент программного обеспечения или объектный модуль с учётом накладываемых этой средой ограничений и предоставляемых возможностей. ",
"АЛГОРИТМ": "Конечная совокупность точно заданных правил решения некоторого класса задач или набор инструкций, описывающих порядок действий исполнителя для решения некоторой задачи.",
"FEC": "Техника помехоустойчивого кодирования и декодирования, позволяющая исправлять ошибки методом упреждения.",
"ARQ": "Метод обнаружения ошибок при передаче данных, использующий сигнал подтверждение приёма  и тайм-аут для обеспечения надёжной передачи по ненадёжным сервисам.",
"ВИДЕОПОТОК": "Временная последовательность кадров определенного формата, закодированная в битовый поток",
"МОДЕЛЬ": "Система, исследование которой служит средством для получения информации о другой системе; представление некоторого реального процесса, устройства или концепции.",
"ПРОТОКОЛ": "Стандарт, описывающий правила взаимодействия функциональных блоков при передаче данных",
"АРХИТЕКТУРА": "Структура программы или вычислительной системы, определяющая ее работу на самом высоком концептуальном уровне, включая аппаратные и программные компоненты, видимые снаружи свойства этих компонентов, отношения между ними, а также документирование системы.",
"JAVASCRIPT": "Мультипарадигменный язык программирования, поддерживающий объектно-ориентированный, императивный и функциональный стили. Является реализацией стандарта ECMAScript. ",
"TCP": "Один из основных протоколов передачи данных интернета, предназначенный для управления передачей данных, с гарантией доставки и сохранения порядка следования пакетов..",
"HTTP": "Протокол прикладного уровня передачи данных, изначально — в виде гипертекстовых документов, сейчас используется для передачи произвольных данных. ",
"PROGRESSIVE_STREAMING": "Принцип передачи медиаконтента при котором он воспроизводится с носителя информации, на который предварительно осуществляется запись",
"REAL-TIMESTREAMING": "Потоковый протокол реального времени — по сути это протокол управления вещанием, он позволяет выполнять несколько команд, такие как «старт», «стоп», «переход на определённое время»",
"МЕДИАСЕРВЕР": "Специализированный сервер, обрабатывающий аудиовидеосигналы, медиа-потоки и файлы в соответствии с расписаниями записи",
"HLS": "Коммуникационный протокол для потоковой передачи медиа на основе HTTP, разработанный компанией Apple как часть программного обеспечения QuickTime, Safari, OS X и iOS. В основе работы лежит принцип разбиения цельного потока на небольшие фрагменты, последовательно скачиваемые по HTTP",
"MPEG DASH": "Технология адаптивной потоковой передачи данных, предоставляющая возможность доставки потокового мультимедиа-контента через Интернет по протоколу HTTP",
"MSS": "Является параметром протокола TCP и определяет максимальный размер полезного блока данных в байтах для TCP-пакета (сегмента).",
"HDS": "Технология адаптивного потокового видео от Microsoft, которая плотно интегрирована с Silverlight, с одной стороны, и IIS – с другой.",
"RTMP": "Проприетарный протокол потоковой передачи данных, в основном используется для передачи потокового видео и аудиопотоков.",
"КОНФИГУРАЦИОННЫЙ-ФАЙЛ": "Файлы, используемые для настройки параметров и начальных настроек для некоторых компьютерных программ, используются для пользовательских приложений, серверных процессов и настроек операционной системы.",
"ВИДЕОКОДЕК": "Алгоритм сжатия, уменьшения размера видеоданных, видеофайла, видеопотока и восстановления сжатых данных.",
"АУДИОКОДЕК": "Алгоритм сжатия, уменьшения размера аудиоданных, аудиофайла, аудиопотока и восстановления сжатых данных.",
"ВИДЕОСЕГМЕНТ": "Представляет собой частицу видео файла, используемую в рамках построения потоковой передачи медиаконтента",
"ПЛЕЙЛИСТ": "Подборка видео и аудиоконтента и других онлайн трансляций технологии",
"DRM": "Программные или программно-аппаратные средства, которые намеренно ограничивают либо затрудняют различные действия с данными в электронной форме копирование, модификацию, просмотр и т. п. либо позволяют отследить такие действия.",
"ИНСТРУМЕНТЫ РАЗРАБОТЧИКА": "Программы, которые позволяют создавать, тестировать и отлаживать программное обеспечение."
}
